[
    {
        "_id": "6356e94d1a782921e8269975",
        "instructor": "Jogesh K. Muppala",
        "instructor_photo": "https://i.ibb.co/ZG85tGg/1.jpg",
        "rating": "4.7",
        "review": "7,562",
        "title": "Web Development with React Specialization",
        "category_id": "2",
        "category": "Web Development",
        "about": "Build Complete Web and Hybrid Mobile Solutions. Master front-end web, hybrid mobile app and server-side development in three comprehensive courses.",
        "students": "8,856",
        "like": "90%",
        "photo_url": "https://i.ibb.co/rbRqpKc/1.jpg",
        "description": "The first two courses in this Specialization cover front-end frameworks: Bootstrap 4 and React. On the server side, you’ll learn to implement NoSQL databases using MongoDB, work within a Node.js environment and Express framework, and communicate to the client side through a RESTful API. Learners enrolling in this Specialization are expected to have prior working knowledge of HTML, CSS and JavaScript.Ideally learners should complete the courses in the specified sequence. ",
        "skills": "Bootstrap,Node.Js, Jquery,SASS,Authentication,Mongodb,Express.Js",
        "level": "Begainer",
        "duration": "13 Hours",
        "price": "39"
    },
    {
        "_id": "6356e94d4ab7ca6b13051576",
        "instructor": "Daniel Randall",
        "instructor_photo": "https://i.ibb.co/DLDvL82/3.jpg",
        "rating": "4.8",
        "review": "3,409",
        "title": "Introduction to Web Development",
        "category_id": "2",
        "category": "Web Development",
        "about": "This course is designed to start you on a path toward future studies in web development and design, no matter how little experience or technical knowledge you currently have.",
        "students": "4,235",
        "like": "94%",
        "photo_url": "https://i.ibb.co/p3fqPCS/2.jpg",
        "description": "This course is designed to start you on a path toward future studies in web development and design, no matter how little experience or technical knowledge you currently have. The web is a very big place, and if you are the typical internet user, you probably visit several websites every day, whether for business, entertainment or education. But have you ever wondered how these websites actually work? How are they built? How do browsers, computers, and mobile devices interact with the web? What skills are necessary to build a website? With almost 1 billion websites now on the internet, the answers to these questions could be your first step toward a better understanding of the internet and developing a new set of internet skills.By the end of this course you’ll be able to describe the structure and functionality of the world wide web, create dynamic web pages using a combination of HTML, CSS, and JavaScript, apply essential programming language concepts when creating HTML forms, select an appropriate web hosting service, and publish your webpages for the world to see. Finally, you’ll be able to develop a working model for creating your own personal or business websites in the future and be fully prepared to take the next step in a more advanced web development or design course or specialization.",
        "skills": "html,css ,JavaScript",
        "level": "Begainer",
        "duration": "2 week",
        "price": "45"
    },
    {
        "_id": "6356e94da8bc393110b3c683",
        "instructor": "Stacey Shanklin-Langford",
        "instructor_photo": "https://i.ibb.co/ZJQRxBC/4.jpg",
        "rating": "4.4",
        "review": "3,182",
        "title": "Build a Full Website using WordPress",
        "category_id": "2",
        "category": "Web Development",
        "about": "This is an advanced level course. Learners should understand web design principles and have familiarity ",
        "students": "5,568",
        "like": "96%",
        "photo_url": "https://i.ibb.co/wwStTBF/3.jpg",
        "description": "By the end of this project, you will create a full web-site that is attractive and user friendly using a free content management system, WordPress. You will learn how to create a website utilizing themes and plug-ins using the web creation tool. You’ll have a virtual space to showcase your business with customers who want to stay connected.Note: This course works best for learners who are based in the North America region. We’re currently working on providing the same experience in other regions.",
        "skills": "Web Development, Design, Marketing,Digital Media, Computer Science",
        "level": "Intermediate",
        "duration": "2 Hours",
        "price": "29"
    },
    {
        "_id": "6356e94d180554f6618f3c4c",
        "instructor": "Maynard Torres",
        "instructor_photo": "https://i.ibb.co/ZG85tGg/1.jpg",
        "rating": "4.8",
        "review": "1,981",
        "title": "Introduction to Front-End Development",
        "category_id": "2",
        "category": "Web Development",
        "about": "This course is a good place to start if you want to become a web developer",
        "students": "2,350",
        "like": "98%",
        "photo_url": "https://i.ibb.co/cw5Lr1b/4.jpg",
        "description": "Welcome to Introduction to Front-End Development, the first course in the Meta Front-End Developer program.This course is a good place to start if you want to become a web developer. You will learn about the day-to-day responsibilities of a web developer and get a general understanding of the core and underlying technologies that power the internet. You will learn how front-end developers create websites and applications that work well and are easy to maintain.You’ll be introduced to the core web development technologies like HTML and CSS and get opportunities to practice using them. You will also be introduced to modern UI frameworks such as Bootstrap and React that make it easy to create interactive user experiences. For the final project in this course, you will create and edit a webpage using HTML and the Bootstrap CSS framework. Using a responsive layout grid, you will construct a responsive webpage containing text and images that looks great on any size screen.This is a beginner course intended for learners eager to learn the fundamentals of web development. To succeed in this course, you do not need prior web development experience, only basic internet navigation skills and an eagerness to get started with coding.",
        "skills": "Web Development Tools,User Interface,Front-End Web Development, HTML and CSS, Responsive Web Design",
        "level": "Expert",
        "duration": "18 Hours",
        "price": "49"
    },
    {
        "_id": "6356e94d1e966e8b078ab55d",
        "instructor": "Manning Weiss",
        "instructor_photo": "https://i.ibb.co/JRnVg02/2.jpg",
        "rating": "4.2",
        "review": "1,233",
        "title": "Mastering Software Development in R ",
        "category_id": "1",
        "category": "Software Development",
        "about": "Build better data science tools.. Learn to design software for data tooling, distribute R packages, and build custom visualizations.",
        "students": "20,230",
        "like": "93%",
        "photo_url": "https://i.ibb.co/Dt6GH9L/6.jpg",
        "description": "R is a programming language and a free software environment for statistical computing and graphics, widely used by data analysts, data scientists and statisticians. This Specialization covers R software development for building data science tools. As the field of data science evolves, it has become clear that software development skills are essential for producing and scaling useful data science results and products.This Specialization will give you rigorous training in the R language, including the skills for handling complex data, building R packages, and developing custom data visualizations. You’ll be introduced to indispensable R libraries for data manipulation, like tidyverse, and data visualization and graphics, like ggplot2. You’ll learn modern software development practices to build tools that are highly reusable, modular, and suitable for use in a team-based environment or a community of developers.This Specialization is designed to serve both data analysts, who may want to gain more familiarity with hands-on, fundamental software skills for their everyday work, as well as data mining experts and data scientists, who may want to use R to scale their developing and programming skills, and further their careers as data science experts.",
        "skills": "R Programming , Data Visualization,Ggplot2, tidyverse,OOP,Data Manipulation,REGEX,Rstudio,Functional Programming ,Github",
        "level": "Intermediate",
        "duration": "2-3 Month",
        "price": "69"
    },
    {
        "_id": "6356e94d2bd79d12b8a8b814",
        "instructor": "Meghan Camacho",
        "instructor_photo": "https://i.ibb.co/DLDvL82/3.jpg",
        "rating": "4.8",
        "review": "1,981",
        "title": "Introduction to Software Development",
        "category_id": "1",
        "category": "Software Development",
        "about": "Software Development, the first course in the Meta Front-End Developer program. ",
        "students": "5,485",
        "like": "95%",
        "photo_url": "https://i.ibb.co/6YHrMbL/5.jpg",
        "description": "Welcome to Introduction to Front-End Development, the first course in the Meta Front-End Developer program.This course is a good place to start if you want to become a web developer. You will learn about the day-to-day responsibilities of a web developer and get a general understanding of the core and underlying technologies that power the internet. You will learn how front-end developers create websites and applications that work well and are easy to maintain.You’ll be introduced to the core web development technologies like HTML and CSS and get opportunities to practice using them. You will also be introduced to modern UI frameworks such as Bootstrap and React that make it easy to create interactive user experiences. ",
        "skills": "Web Development Tools,User Interface, Front-End Web Development, HTML and CSS, Responsive Web Design",
        "level": "Begainer",
        "duration": "1 Month",
        "price": "39"
    },
    {
        "_id": "6356e94da28940590ff39a13",
        "instructor": "Kenneth W T Leung",
        "instructor_photo": "https://i.ibb.co/ZJQRxBC/4.jpg",
        "rating": "4.1",
        "review": "14",
        "title": "Software Design and Project Management",
        "category_id": "1",
        "category": "Software Development",
        "about": "recommended to take the course Software Engineering: Modeling Software Systems using UML",
        "students": "105",
        "like": "98%",
        "photo_url": "https://i.ibb.co/k24GGZd/7.jpg",
        "description": "Software Development Life Cycle (SDLC) is the process of developing software through planning, requirement analysis, design, implementation, testing, and maintenance. This course focuses on the project planning and analysis/design phases of SDLC, and you will learn about different architectural patterns and design patterns to solve common problems in software design. It covers project planning, scheduling, and cost estimating, which are the principal tasks of software project managers.Basic object-oriented programming (OOP) concepts are required to understand different design patterns covered in this course. System design is driven by the UML models derived from requirement analysis. It is recommended to take the course Software Engineering: Modeling Software Systems using UML before attempting this course, but it is not a hard requirement.",
        "skills": "Project Management,Software Engineering,Systems Design,Project Planning",
        "level": "Expert",
        "duration": "12 week",
        "price": "89"
    },
    {
        "_id": "6356e94ddeb34cd25f419d20",
        "instructor": "Barrera Joseph",
        "instructor_photo": "https://i.ibb.co/4P8WkBf/5.jpg",
        "rating": "4.7",
        "review": "84",
        "title": "Introduction to Mobile Development",
        "category_id": "3",
        "category": "Mobile Development",
        "about": "If you want to become a mobile developer, this course is a good place to start.",
        "students": "236",
        "like": "97%",
        "photo_url": "https://i.ibb.co/SvNDw39/8.jpg",
        "description": "If you want to become a mobile developer, this course is a good place to start. You will learn about the day-to-day responsibilities of web and mobile developers and get a general understanding of the core and underlying technologies that power the internet.You’ll be introduced to core technologies like HTML and CSS, and get opportunities to practice using them.In this course, you will also discover the unique world of cross-platform mobile applications (apps). Explore the various benefits of using a system like React Native to build mobile apps and get an opportunity to practice the basics.",
        "skills": "Web Development,React (Web Framework),HTML and CSS,Mobile Development,JavaScript",
        "level": "Begainer",
        "duration": "12 Hours",
        "price": "19"
    },
    {
        "_id": "6356e94dabcc731e9b5fbcac",
        "instructor": "Brian Winn",
        "instructor_photo": "https://i.ibb.co/0JxWbB8/6.jpg",
        "rating": "4.8",
        "review": "386",
        "title": "Game Design and Development with Unity",
        "category_id": "4",
        "category": "Game Development",
        "about": "Launch Your Career in Game Design and Development. Learn the theory and practice of game making using Unity",
        "students": "854",
        "like": "98%",
        "photo_url": "https://i.ibb.co/6Pv5xQm/9.jpg",
        "description": "Break into the video game industry with theoretical, technical, and practical knowledge from one of the world’s best programs.In this completely revised 2021 version of the Specialization, learners build the skills necessary to design and development games. The Specialization focuses on both the theory and practice of game making. From a technical standpoint, learners create four game projects in the latest Unity 2020 game engine, include a 2D Shooter, 2D Platformer, First-Person Shooter, and 3D Platformer. In the Capstone Project, learners create a completely original game of their own design from initial concept up to the first playable prototype. The Specialization comes from the Michigan State University game program which is ranked as one of the top programs in North America.",
        "skills": "Video Game Development,Unity,video game,Game Design,technology,Game Making",
        "level": "Intermediate",
        "duration": "6 Hours",
        "price": "43"
    },
    {
        "_id": "6356e94d45c27a9fb6fdb918",
        "instructor": "Chasity Hill",
        "instructor_photo": "https://i.ibb.co/JRnVg02/2.jpg",
        "rating": "4.6",
        "review": "1,932",
        "title": "Introduction to Basic Game Development using Scratch",
        "category_id": "4",
        "category": "Game Development",
        "about": "By the end of this project, you will create a basic game using an introductory, web-based coding program called Scratch.",
        "students": "2,350",
        "like": "95%",
        "photo_url": "https://i.ibb.co/X2k52dS/10.jpg",
        "description": "By the end of this project, you will create a basic game using an introductory, web-based coding program called Scratch.  Learning to code will allow you to build basic coding or computer science skills and a fundamental understanding in order to grow your programming abilities. Learners will engage in the design process in order to develop an understanding of how to develop algorithms that control programs, use event-driven programming, and debug a program.Note: This course works best for learners who are based in the North America region. We’re currently working on providing the same experience in other regions.",
        "skills": "coding,Game Design, Computer Programming, Computer Science Scratch",
        "level": "Begainer",
        "duration": "2 Hours",
        "price": "19"
    },
    {
        "_id": "6356e94d5440e6194ec4a979",
        "instructor": "Kirkland Foster",
        "instructor_photo": "https://i.ibb.co/G93RzMq/11.jpg",
        "rating": "4.6",
        "review": "2,852",
        "title": "Network Security & Database Vulnerabilities",
        "category_id": "7",
        "category": "Network And Security",
        "about": "This course can be applied to multiple Specializations or Professional Certificates programs.",
        "students": "4,365",
        "like": "97%",
        "photo_url": "https://i.ibb.co/WWt3J1s/11.jpg",
        "description": "This course gives you the background needed to understand basic network security.  You will learn the about Local Area Networks, TCP/IP, the OSI Framework and routing basics.  You will learn how networking affects security systems within an organization.  You will learn the network components that guard an organization from cybersecurity attacks,In addition to networking, you will learn about database vulnerabilities and the tools/knowledge needed to research a database vulnerability for a variety of databases including SQL Injection, Oracle, Mongo and Couch. You will learn about various security breach types associated with databases and organizations that define standards and provide tools for cybersecurity professionals.This course is intended for anyone who wants to gain a basic understanding of Network Security/Database Vulnerabilities or as the fourth course in a series of courses to acquire the skills to work in the Cybersecurity field as a Jr Cybersecurity Analyst.",
        "skills": "database vulnerabilities,Network Security, Sql Injection,Cybersecurity,networking basics",
        "level": "Intermediate",
        "duration": "8 Hours",
        "price": "25"
    },
    {
        "_id": "6356e94d14d9bb1fd4b067d3",
        "instructor": "Janette Haynes",
        "instructor_photo": "https://i.ibb.co/G93RzMq/11.jpg",
        "rating": "4.2",
        "review": "1,320",
        "title": "Wireshark for Basic Network Security Analysis",
        "category_id": "7",
        "category": "Network And Security",
        "about": "Learn how to troubleshoot with Wireshark, capture Traffic and analyze already captured Traffic.",
        "students": "1,950",
        "like": "92%",
        "photo_url": "https://i.ibb.co/DM9VsDL/12.jpg",
        "description": "In this 1-hour 30-minutes long project-based course, you will learn how to use Wireshark to capture the Network Traffic you need and analyze it securely. You will have a better understanding of encrypted and unencrypted traffic and how to differentiate between them. You will dig deeply into unencrypted protocols such as RADIUS, HTTP, DNS and Telnet by generating the Traffic of each of them and capturing it yourself. Also you will generate, capture and look into secure and encrypted protocols such as HTTPS and SSH. Additionally, you will learn how to capture HTTPS Traffic and decrypt them by using a pre-master secret key.Note: This project works best for learners who are based in the North America region. We’re currently working on providing the same experience in other regions.",
        "skills": "Network Security,Wireshark,security,Networking",
        "level": "Expert",
        "duration": "15 Hours",
        "price": "39"
    },
    {
        "_id": "6356e94de28c426d8ecc8579",
        "instructor": "Frances Tillman",
        "instructor_photo": "https://i.ibb.co/pjPRcJH/9.jpg",
        "rating": "4.8",
        "review": "235",
        "title": "Managing Network Security",
        "category_id": "7",
        "category": "Network And Security",
        "about": "Identify the practices, tools, and methodologies associated with assessing network security",
        "students": "955",
        "like": "98%",
        "photo_url": "https://i.ibb.co/k4fcMmb/13.jpg",
        "description": "Almost every organization uses computer networks to share their information and to support their business operations. When we allow network access to data  it is exposed to threats from inside and outside of the organization.  This course examines the threats associated with using internal and external networks and how to manage the protection of information when it’s accessible via networks.",
        "skills": "Wireless Security,Intrusion Detection System,Firewall (Computing),Computer Network",
        "level": "Begainer",
        "duration": "1 week",
        "price": "29"
    },
    {
        "_id": "6356e94d8610efed1da8a25b",
        "instructor": "Shepherd Harvey",
        "instructor_photo": "https://i.ibb.co/BVmPSkM/7.jpg",
        "rating": "4.4",
        "review": "2,950",
        "title": "Data Science Specialization",
        "category_id": "6",
        "category": "Data Science",
        "about": "Launch Your Career in Data Science. A ten-course introduction to data science, developed and taught by leading professors.",
        "students": "5,265",
        "like": "96%",
        "photo_url": "https://i.ibb.co/1sML665/14.jpg",
        "description": "Ask the right questions, manipulate data sets, and create visualizations to communicate results.This Specialization covers the concepts and tools you'll need throughout the entire data science pipeline, from asking the right kinds of questions to making inferences and publishing results. In the final Capstone Project, you’ll apply the skills learned by building a data product using real-world data. At completion, students will have a portfolio demonstrating their mastery of the material. ",
        "skills": "Github,Machine Learning,R Programming,Data Science,Debugging,Data Manipulation,REGEX,Cluster Analysis",
        "level": "Advance",
        "duration": "22 Hours",
        "price": "49"
    },
    {
        "_id": "6356e94dd2db5cc2f34bf550",
        "instructor": "Snow Pitts",
        "instructor_photo": "https://i.ibb.co/pjPRcJH/9.jpg",
        "rating": "4.3",
        "review": "365",
        "title": "Machine Learning Specialization",
        "category_id": "6",
        "category": "Data Science",
        "about": "Machine Learning Specialization. Master fundamental AI concepts and develop practical machine learning skills in the beginner-friendly",
        "students": "952",
        "like": "98%",
        "photo_url": "https://i.ibb.co/b1B6k5C/15.jpg",
        "description": "The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. This beginner-friendly program will teach you the fundamentals of machine learning and how to use these techniques to build real-world AI applications. This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field. This 3-course Specialization is an updated version of Andrew’s pioneering Machine Learning course, rated 4.9 out of 5 and taken by over 4.8 million learners since it launched in 2012.It provides a broad introduction to modern machine learning, including supervised learning (multiple linear regression, logistic regression, neural networks, and decision trees), unsupervised learning (clustering, dimensionality reduction, recommender systems), and some of the best practices used in Silicon Valley for artificial intelligence and machine learning innovation (evaluating and tuning models, taking a data-centric approach to improving performance, and more.) By the end of this Specialization, you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems. If you’re looking to break into AI or build a career in machine learning, the new Machine Learning Specialization is the best place to start.",
        "skills": "Decision Trees,Artificial Neural Network,Logistic Regression,Recommender Systems",
        "level": "Advance",
        "duration": "16 Hours",
        "price": "59"
    },
    {
        "_id": "6356e94d2f5741ab6daaae80",
        "instructor": "Gabriela Rowland",
        "instructor_photo": "https://i.ibb.co/cYN40BT/10.jpg",
        "rating": "4.8",
        "review": "5,232",
        "title": "Genomic Data Science Specialization",
        "category_id": "6",
        "category": "Data Science",
        "about": "Be a next generation sequencing data scientist.. Master the tools and techniques at the forefront of the sequencing data revolution.",
        "students": "9,852",
        "like": "94%",
        "photo_url": "https://i.ibb.co/FXbm3Y5/16.jpg",
        "description": "With genomics sparks a revolution in medical discoveries, it becomes imperative to be able to better understand the genome, and be able to leverage the data and information from genomic datasets. Genomic Data Science is the field that applies statistics and data science to the genome.This Specialization covers the concepts and tools to understand, analyze, and interpret data from next generation sequencing experiments. It teaches the most common tools used in genomic data science including how to use the command line, along with a variety of software implementation tools like Python, R, and Bioconductor.This Specialization is designed to serve as both a standalone introduction to genomic data science or as a perfect compliment to a primary degree or postdoc in biology, molecular biology, or genetics, for scientists in these fields seeking to gain familiarity in data science and statistical tools to better interact with the data in their everyday work.",
        "skills": "Bioinformatics,Statistics,Data Science,Computational Biology,Biopython,Python Programming, Genomics, Samtools, Unix",
        "level": "Advance",
        "duration": "20 Hours",
        "price": "79"
    },
    {
        "_id": "6356e94d40b519aa4ac709ed",
        "instructor": "Stark Crawford",
        "instructor_photo": "https://i.ibb.co/FHKDqjp/12.jpg",
        "rating": "4.6",
        "review": "1,845",
        "title": "Python for Everybody",
        "category_id": "8",
        "category": "Programming Language",
        "about": "Learn to Program and Analyze Data with Python. Develop programs to gather, clean, analyze, and visualize data.",
        "students": "4,520",
        "like": "91%",
        "photo_url": "https://i.ibb.co/DCPWtDG/17.jpg",
        "description": "This Specialization builds on the success of the Python for Everybody course and will introduce fundamental programming concepts including data structures, networked application program interfaces, and databases, using the Python programming language. In the Capstone Project, you’ll use the technologies learned throughout the Specialization to design and create your own  applications for data retrieval, processing, and visualization.",
        "skills": "Json,Python Programming,Database (DBMS),Python Syntax And Semantics,Data Structure,Sqlite",
        "level": "Expert",
        "duration": "23 Hours",
        "price": "99"
    },
    {
        "_id": "6356e94d8c56babd340fc751",
        "instructor": "Faye Murphy",
        "instructor_photo": "https://i.ibb.co/G93RzMq/11.jpg",
        "rating": "4.7",
        "review": "1,580",
        "title": "Programming Fundamentals",
        "category_id": "8",
        "category": "Programming Language",
        "about": "This module introduces a powerful process for solving any programming problem—the Seven Steps.",
        "students": "3,958",
        "like": "96%",
        "photo_url": "https://i.ibb.co/4jBJn7v/18.jpg",
        "description": "Programming is an increasingly important skill, whether you aspire to a career in software development, or in other fields. This course is the first in the specialization Introduction to Programming in C, but its lessons extend to any language you might want to learn. This is because programming is fundamentally about figuring out how to solve a class of problems and writing the algorithm, a clear set of steps to solve any problem in its class. This course will introduce you to a powerful problem-solving process—the Seven Steps—which you can use to solve any programming problem. In this course, you will learn how to develop an algorithm, then progress to reading code and understanding how programming concepts relate to algorithms.",
        "skills": "Algorithms,Programming Language Concepts,Problem Solving,C Programming",
        "level": "Intermediate",
        "duration": "9 Hours",
        "price": "29"
    },
    {
        "_id": "6356e94d344dfa17fe7b4167",
        "instructor": "Simone Mercer",
        "instructor_photo": "https://i.ibb.co/cYN40BT/10.jpg",
        "rating": "4.6",
        "review": "845",
        "title": "Python 3 Programming",
        "category_id": "8",
        "category": "Programming Language",
        "about": "Become a Fluent Python Programmer. Learn the fundamentals and become an independent programmer.",
        "students": "1,652",
        "like": "96%",
        "photo_url": "https://i.ibb.co/vZd4qdw/19.jpg",
        "description": "This specialization teaches the fundamentals of programming in Python 3. We will begin at the beginning, with variables, conditionals, and loops, and get to some intermediate material like keyword parameters, list comprehensions, lambda expressions, and class inheritance.You will have lots of opportunities to practice. You will also learn ways to reason about program execution, so that it is no longer mysterious and you are able to debug programs when they don’t work.By the end of the specialization, you’ll be writing programs that query Internet APIs for data and extract useful information from them.  And you’ll be able to learn to use new modules and APIs on your own by reading the documentation. That will give you a great launch toward being an independent Python programmer. This specialization is a good next step for you if you have completed Python for Everybody but want a more in-depth treatment of Python fundamentals and more practice, so that you can proceed with confidence to specializations like Applied Data Science with Python.But it is also appropriate as a first set of courses in Python if you are already familiar with some other programming language, or if you are up for the challenge of diving in head-first.",
        "skills": "Json,Computer Programming,Python Programming,Sorting",
        "level": "Begainer",
        "duration": "8 Hours",
        "price": "19"
    },
    {
        "_id": "6356e94dec55f13599f96734",
        "instructor": "Shaw Huber",
        "instructor_photo": "https://i.ibb.co/0JxWbB8/6.jpg",
        "rating": "4.9",
        "review": "2,450",
        "title": "Building Cloud Computing Solutions at Scale",
        "category_id": "5",
        "category": "Cloud Computing",
        "about": "Launch Your Career in Cloud Computing. Master strategies and tools to become proficient in developing data science and machine learning solutions in the Cloud",
        "students": "3,984",
        "like": "98%",
        "photo_url": "https://i.ibb.co/J510vX4/20.jpg",
        "description": "With more companies leveraging software that runs on the Cloud, there is a growing need to find and hire individuals with the skills needed to build solutions on a variety of Cloud platforms. Employers agree: Cloud talent is hard to find. This Specialization is designed to address the Cloud talent gap by providing training to anyone interested in developing the job-ready, pragmatic skills needed for careers that leverage Cloud-native technologies.In the first course, you will learn how to build foundational Cloud computing infrastructure, including websites involving serverless technology and virtual machines, using the best practices of DevOps. The second course will teach you how to build effective Microservices using technologies like Flask and Kubernetes that are continuously deployed to a Cloud platform: Amazon Web Services (AWS), Azure or Google Cloud Platform (GCP). The third course begins to put together all of the Cloud concepts introduced in the first two courses to tackle more complex data engineering solutions. And finally, in the fourth course you will apply Machine Learning Engineering to build a Flask web application that serves out Machine Learning predictions.",
        "skills": "Cloud Platforms,Cloud API, Machine Learning,Cloud Databases,Cloud Computing,Devops",
        "level": "Advance",
        "duration": "6 Hours",
        "price": "14"
    },
    {
        "_id": "6356e94d48d0e7334ec0f572",
        "instructor": "Manuela Kaufman",
        "instructor_photo": "https://i.ibb.co/BVmPSkM/7.jpg",
        "rating": "4.1",
        "review": "654",
        "title": "Cloud Computing Specialization",
        "category_id": "5",
        "category": "Cloud Computing",
        "about": "Clouds, Distributed Systems, Networking. Learn about and build distributed and networked systems for clouds and big data.",
        "students": "1,250",
        "like": "97%",
        "photo_url": "https://i.ibb.co/DRgtHVW/21.jpg",
        "description": "The Cloud Computing Specialization takes you on a tour through cloud computing systems. We start in in the middle layer with Cloud Computing Concepts covering core distributed systems concepts used inside clouds, move to the upper layer of Cloud Applications and finally to the lower layer of Cloud Networking. We conclude with a project that allows you to apply the skills you've learned throughout the courses.The first four courses in this Specialization form the lecture component of courses in our online Master of Computer Science Degree in Data Science. You can apply to the degree program either before or after you begin the Specialization.",
        "skills": "Big Data,Cloud Computing,Distributed Algorithm,C++,NoSQL,Cloud Storage,Graphs,Machine Learning",
        "level": "Expert",
        "duration": "29 Hours",
        "price": "99"
    }
]